/*#include<stdio.h>
void main()
{
    int N,t,j,i;
    int a[101];
    scanf("%d",&N);
    for(int i=0;i<N;i++)
    {
        scanf("%d",&a[i]);
    }
    for(int j=0;j<N-1;j++)
    {
        for(int i=0;i<N-1-j;i++)
        {
            if(a[i]>a[i+1])
            {t=a[i];a[i]=a[i+1];a[i+1]=t;}
        }//先将所有字母从小到大排序
    }
    //for(int i=0;i<N;i++)
    //{
    //    printf("%d ",a[i]);
    //}
    //检查排序结果

    for(int i=0;i<N;i++)
    {
        for(int j=0;j<N;j++)
        {
            if(a[i]==a[j]&&i!=j)
            {
                for(int k=j;k<=N-1;k++)
                {
                    a[k]=a[k+1];
                }

            }
        }
    }
    printf("%d\n",i);
    for(int k=0;k<i;k++)
    {
        printf("%d ",a[k]);
    }

}
*/


#include<stdio.h>
void main()
{
    int M,i,n=0;
    int a[100+1],b[1000+1]={0};
    scanf("%d",&M);
    for(i=0;i<M;i++)
    {
        scanf("%d",&a[i]);
    }
    for(i=0;i<M;i++)
    {
        b[a[i]]++;//用b数组记录出现次数
    }
    for(i=1;i<=1000;i++)//依题意a[i]的大小在1到1000内
    {
        if(b[i]!=0)
        n++;//记录不重复数个数
    }
    printf("%d\n",n);
    for(i=1;i<=1000;i++)//这样子循环判断就顺便排序了
    {
        if(b[i]!=0)//即不管出现几次出现就输出一次
            printf("%d ",i);
    }

}
//桶排达到排序并去重的目的
/*先生成了N个1到1000之间的随机整数（N≤100），对于其中重复的数字，只保留一个，把其余相同的数去掉，然后再把这些数从小到大排序，按照排好的顺序输出。请完成“去重”与“排序”的工作

格式
输入格式


输入数据有2行，第1行为1个正整数，表示所生成的随机数的个数：N
第2行有N个用空格隔开的正整数，为所产生的随机数。

输出格式


输出有2行，第1行为1个正整数M，表示不相同的随机数的个数。第2行为M个用空格隔开的正整数，为从小到大排好序的不相同的随机数。

样例
样例输入 Copy
10
20 40 32 67 40 20 89 300 400 15
样例输出 Copy
8
15 20 32 40 67 89 300 400
*/
